Revit 2024 API
ForgeTypeId.NameEquals Method
 Returns true if the typeid string held by this ForgeTypeId is equal to that held by the given ForgeTypeId, excluding the version number. The version number of a typeid string follows a hyphen character. This function compares the typeid strings up to the first hyphen. This is the default equality comparison method for the ForgeTypeId class, used by the equality operator (==).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public bool NameEquals(
	ForgeTypeId other
)
Visual Basic
Public Function NameEquals ( _
	other As ForgeTypeId _
) As Boolean
Visual C++
public:
bool NameEquals(
	ForgeTypeId^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ForgeTypeId
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace